k6/output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: jpetstore-performance-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 46s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 16s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)

time="2025-11-01T14:21:25-05:00" level=info msg="🚀 Iniciando prueba de carga K6 para JPetStore" source=console
time="2025-11-01T14:21:25-05:00" level=info msg="📊 Configuración: 50 usuarios virtuales, ramp-up 10s" source=console
time="2025-11-01T14:21:25-05:00" level=info msg="🎯 URL objetivo: https://jpetstore.aspectran.com/catalog/categories/FISH" source=console

running (01.0s), 05/50 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 05/50 VUs  01.0s/16.0s

running (02.0s), 10/50 VUs, 0 complete and 0 interrupted iterations
default   [  12% ] 10/50 VUs  02.0s/16.0s

running (03.0s), 15/50 VUs, 0 complete and 0 interrupted iterations
default   [  19% ] 15/50 VUs  03.0s/16.0s

running (04.0s), 20/50 VUs, 0 complete and 0 interrupted iterations
default   [  25% ] 20/50 VUs  04.0s/16.0s

running (05.0s), 25/50 VUs, 0 complete and 0 interrupted iterations
default   [  31% ] 25/50 VUs  05.0s/16.0s

running (06.0s), 30/50 VUs, 0 complete and 0 interrupted iterations
default   [  37% ] 30/50 VUs  06.0s/16.0s

running (07.0s), 35/50 VUs, 28 complete and 0 interrupted iterations
default   [  44% ] 35/50 VUs  07.0s/16.0s

running (08.0s), 40/50 VUs, 61 complete and 0 interrupted iterations
default   [  50% ] 40/50 VUs  08.0s/16.0s

running (09.0s), 45/50 VUs, 98 complete and 0 interrupted iterations
default   [  56% ] 45/50 VUs  09.0s/16.0s

running (10.0s), 49/50 VUs, 137 complete and 0 interrupted iterations
default   [  62% ] 49/50 VUs  10.0s/16.0s

running (11.0s), 50/50 VUs, 183 complete and 0 interrupted iterations
default   [  69% ] 50/50 VUs  11.0s/16.0s

running (12.0s), 48/50 VUs, 225 complete and 0 interrupted iterations
default   [  75% ] 48/50 VUs  12.0s/16.0s

running (13.0s), 36/50 VUs, 266 complete and 0 interrupted iterations
default   [  81% ] 36/50 VUs  13.0s/16.0s

running (14.0s), 27/50 VUs, 289 complete and 0 interrupted iterations
default   [  87% ] 27/50 VUs  14.0s/16.0s

running (15.0s), 19/50 VUs, 314 complete and 0 interrupted iterations
default   [  94% ] 19/50 VUs  15.0s/16.0s

running (16.0s), 08/50 VUs, 333 complete and 0 interrupted iterations
default   [ 100% ] 08/50 VUs  16.0s/16.0s
time="2025-11-01T14:21:42-05:00" level=info msg="✅ Prueba de carga completada" source=console


  █ THRESHOLDS 

    errors
    ✓ 'rate<0.01' rate=0.00%

    http_req_duration
    ✓ 'p(95)<5000' p(95)=353.89ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1364    81.650235/s
    checks_succeeded...: 100.00% 1364 out of 1364
    checks_failed......: 0.00%   0 out of 1364

    ✓ status is 200
    ✓ response time < 5000ms
    ✓ page contains FISH
    ✓ response size > 0

    CUSTOM
    errors.........................: 0.00%  0 out of 341

    HTTP
    http_req_duration..............: avg=307.45ms min=278.86ms med=298.88ms max=704.01ms p(90)=318.23ms p(95)=353.89ms
      { expected_response:true }...: avg=307.45ms min=278.86ms med=298.88ms max=704.01ms p(90)=318.23ms p(95)=353.89ms
    http_req_failed................: 0.00%  0 out of 682
    http_reqs......................: 682    40.825118/s

    EXECUTION
    iteration_duration.............: avg=1.33s    min=1.07s    med=1.1s     max=6.57s    p(90)=1.34s    p(95)=2.87s   
    iterations.....................: 341    20.412559/s
    vus............................: 8      min=5        max=50
    vus_max........................: 50     min=50       max=50

    NETWORK
    data_received..................: 2.5 MB 150 kB/s
    data_sent......................: 330 kB 20 kB/s



running (16.7s), 00/50 VUs, 341 complete and 0 interrupted iterations
default ✓ [ 100% ] 00/50 VUs  16s